> 부호란 의사소통을 가능하게 하는 것이라고 할 수 있다.
 
부호(코드/code)라는 용어는 일반적으로 사람과 컴퓨터 간에 정보를 전달하는 체계를 의미한다. 

<br>

### 어떻게 보면 단어라는 것도 일종의 부호라고 말할 수 있다.

의사소통을 위해서 수많은 부호들이 사용된다. 몇몇 부호들이 다른 것들보다 특정 측면에서 적합하기 때문이다. 어떤 부로가 다른 부호로는 처리가 불가능한 경우에도 적절히 사용될 수 있다면 그 부호는 유용하다고 말할 수 있다.

<br>

### 점과 선은 깜빡임의 종류에 상용하게 된다.

규칙 없이 이루어진 것으로 보인다. 하지만 영어에서 자주 사용되는 E와 T 같은 문자에는 좀 더 짧고 간단한 부호가 할당된다.

<br>

___

<br>

나의 생각

### 두 가지 모음

저자는 
>"두 가지 형태의 깜빡임, 두 가지 모음, 실제로 두 가지 다른 것들은 적절히 조합되어 모든 형태의 정보를 전달할 수 있다"

라고 말하였다.

<br>

### 두 가지 형태로 모든 정보를 전달할 수 있다는 것이 정말 가능할까.

2차원적인 것이 아닌 3차원 적인 무언가를 표현하는 것을 두 가지 형태로 표현하는 것도 가능할까. 아니면 3차원적으로 굳이 표현하지 않아도 되는 것들이 아닐까. 3차원적인 표현이 필수적인 것이 아니기에 두 가지 형태로도 표현이 가능하겠지? 두 가지의 형태로 모든 형태의 정보를 전달한다는 것은 너무 충격적이다.
